# Chapter 7

In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0]= None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1,NA,3.5,NA,7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned = data.dropna()

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4]=NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7,3))

In [22]:
df.iloc[:4,2] = NA

In [23]:
df.iloc[:2,2] = NA

In [24]:
df

          0         1         2
0 -1.786957  0.271572       NaN
1 -0.295526  0.077437       NaN
2  0.265510  1.119558       NaN
3  2.476100  0.101605       NaN
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [25]:
df.dropna()

          0         1         2
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [26]:
df.dropna(thresh=2)

          0         1         2
0 -1.786957  0.271572       NaN
1 -0.295526  0.077437       NaN
2  0.265510  1.119558       NaN
3  2.476100  0.101605       NaN
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [27]:
df.fillna(0)

          0         1         2
0 -1.786957  0.271572  0.000000
1 -0.295526  0.077437  0.000000
2  0.265510  1.119558  0.000000
3  2.476100  0.101605  0.000000
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [28]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.786957  0.271572  0.000000
1 -0.295526  0.077437  0.000000
2  0.265510  1.119558  0.000000
3  2.476100  0.101605  0.000000
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [29]:
_=df.fillna(0,inplace=True)

In [30]:
df

          0         1         2
0 -1.786957  0.271572  0.000000
1 -0.295526  0.077437  0.000000
2  0.265510  1.119558  0.000000
3  2.476100  0.101605  0.000000
4 -0.168201 -0.162507 -0.637233
5 -0.818425 -2.777319  0.113415
6 -0.425806  1.839365  0.822657

In [31]:
df = pd.DataFrame(np.random.randn(6,3))

In [32]:
df.iloc[2:,1]=NA

In [33]:
df.iloc[4:,2]=NA

In [34]:
df

          0         1         2
0  2.164562  0.229932 -0.505113
1 -0.724555 -0.846122  0.355886
2 -0.502609       NaN  1.036975
3 -1.633977       NaN -0.045483
4 -2.356779       NaN       NaN
5 -0.617317       NaN       NaN

In [35]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  2.164562  0.229932 -0.505113
1 -0.724555 -0.846122  0.355886
2 -0.502609 -0.846122  1.036975
3 -1.633977 -0.846122 -0.045483
4 -2.356779       NaN -0.045483
5 -0.617317       NaN -0.045483

In [36]:
data=pd.Series([1.,NA,3.5,NA,7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [38]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)

In [43]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
    'Pastrami', 'corned beef', 'Bacon',
     'pastrami', 'honey ham', 'nova lox'],
     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [51]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox':'salmon'}

In [52]:
lowercased = data['food'].str.lower()

In [53]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [54]:
data['animal']=lowercased.map(meat_to_animal)

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [56]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [57]:
data = pd.Series([1.,-999.,2,-999.,-1000.,3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999.,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
      index=['Ohio', 'Colorado', 'New York'],
      columns=['one', 'two', 'three', 'four'])

In [63]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
transform = lambda x: x[:4].upper()

In [65]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [69]:
data.index = data.index.map(transform)

In [70]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [71]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [72]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [73]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [74]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [75]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [76]:
bins = [18, 25, 35, 60, 100]

In [77]:
cats = pd.cut(ages,bins)

In [78]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [80]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [81]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [82]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [83]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [84]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [85]:
data = np.random.rand(20)

In [86]:
pd.cut(data, 4, precision=2)

[(0.059, 0.29], (0.29, 0.53], (0.29, 0.53], (0.76, 1.0], (0.29, 0.53], ..., (0.059, 0.29], (0.53, 0.76], (0.059, 0.29], (0.059, 0.29], (0.53, 0.76]]
Length: 20
Categories (4, interval[float64]): [(0.059, 0.29] < (0.29, 0.53] < (0.53, 0.76] < (0.76, 1.0]]

In [87]:
data = np.random.randn(1000)

In [88]:
cats = pd.qcut(data, 4)

In [89]:
cats

[(0.625, 3.144], (-2.912, -0.657], (0.625, 3.144], (0.625, 3.144], (0.625, 3.144], ..., (0.625, 3.144], (0.625, 3.144], (0.625, 3.144], (-0.0348, 0.625], (-2.912, -0.657]]
Length: 1000
Categories (4, interval[float64]): [(-2.912, -0.657] < (-0.657, -0.0348] < (-0.0348, 0.625] < (0.625, 3.144]]

In [90]:
pd.value_counts(cats)

(0.625, 3.144]       250
(-0.0348, 0.625]     250
(-0.657, -0.0348]    250
(-2.912, -0.657]     250
dtype: int64

In [91]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.167, 3.144], (-1.256, -0.0348], (-0.0348, 1.167], (1.167, 3.144], (1.167, 3.144], ..., (-0.0348, 1.167], (1.167, 3.144], (-0.0348, 1.167], (-0.0348, 1.167], (-1.256, -0.0348]]
Length: 1000
Categories (4, interval[float64]): [(-2.912, -1.256] < (-1.256, -0.0348] < (-0.0348, 1.167] < (1.167, 3.144]]

In [92]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [93]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006883    -0.033950    -0.018233    -0.022204
std       0.986182     1.012404     1.024074     0.993275
min      -2.890100    -3.190004    -2.881343    -3.944261
25%      -0.672989    -0.686957    -0.707819    -0.654929
50%      -0.012302    -0.043581    -0.028845    -0.016970
75%       0.619919     0.635862     0.659140     0.628066
max       3.600276     3.249309     3.130691     2.770083

In [94]:
col = data[2]

In [95]:
col[np.abs(col) > 3]

141    3.012242
947    3.130691
Name: 2, dtype: float64

In [96]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
42  -0.511990 -0.244286 -0.304991 -3.206598
141  0.451733 -0.760579  3.012242  1.752600
162 -0.070699  1.013293 -1.052760 -3.944261
654 -0.822780 -3.090257 -1.121055  0.687423
741  1.428990 -0.583829 -0.629606 -3.729030
771  0.993523  3.080898  0.748144  0.722372
788 -0.073226 -3.190004  0.027184  0.606687
799  0.082933  3.249309 -1.270177 -0.848215
834  3.600276 -1.884434  1.417070 -0.076989
947  0.339175 -1.852968  3.130691 -0.054643

In [97]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [98]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007483    -0.034000    -0.018376    -0.020324
std       0.984165     1.010534     1.023643     0.986873
min      -2.890100    -3.000000    -2.881343    -3.000000
25%      -0.672989    -0.686957    -0.707819    -0.654929
50%      -0.012302    -0.043581    -0.028845    -0.016970
75%       0.619919     0.635862     0.659140     0.628066
max       3.000000     3.000000     3.000000     2.770083

In [99]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1 -1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0  1.0
4  1.0 -1.0 -1.0  1.0

In [100]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [101]:
sampler = np.random.permutation(5)

In [102]:
sampler

array([3, 4, 0, 2, 1])

In [103]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [104]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7

In [105]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [106]:
choices = pd.Series([5, 7, -1, 6, 4])

In [107]:
draws = choices.sample(n=10, replace=True)

In [108]:
draws

4    4
2   -1
3    6
3    6
1    7
0    5
0    5
0    5
2   -1
2   -1
dtype: int64

In [109]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})

In [110]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [111]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [112]:
df_with_dummy = df[['data1']].join(dummies)

In [113]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [117]:
mnames = ['movie_id', 'title', 'genres']

In [118]:
 movies = pd.read_table('movies.dat', sep='::',header=None, names=mnames)

<ipython-input-118-84552af8c0e6>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('movies.dat', sep='::',header=None, names=mnames)

In [119]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [193]:
all_genres = []

In [194]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [195]:
genres = pd.unique(all_genres)

In [196]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [197]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [198]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [199]:
gen = movies.genres[0]

In [200]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [201]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [202]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [203]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [204]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [205]:
np.random.seed(12345)

In [206]:
values = np.random.rand(10)

In [207]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [208]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [209]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [210]:
val = 'a,b, guido'

In [211]:
val.split(',')

['a', 'b', ' guido']

In [212]:
pieces = [x.strip() for x in val.split(',')]

In [213]:
pieces

['a', 'b', 'guido']

In [214]:
first, second, third = pieces

In [215]:
first + '::' + second + '::' + third

'a::b::guido'

In [216]:
'::'.join(pieces)

'a::b::guido'

In [217]:
'guido' in val

True

In [218]:
val.index(',')

1

In [219]:
val.find(':')

-1

In [220]:
val.index(':')

ValueError: substring not found

In [221]:
val.count(',')

2

In [222]:
val.replace(',', '::')

'a::b:: guido'

In [223]:
val.replace(',', '')

'ab guido'

In [224]:
import re

In [225]:
text = "foo bar\t baz \tqux"

In [226]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [227]:
regex = re.compile('\s+')

In [228]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [229]:
regex.findall(text)

[' ', '\t ', ' \t']

In [230]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [231]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [232]:
m = regex.search(text)

In [233]:
m

In [234]:
text[m.start():m.end()]

'dave@google.com'

In [235]:
print(regex.match(text))

None

In [236]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [237]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [238]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [239]:
m = regex.match('wesm@bright.net')

In [240]:
m.groups()

('wesm', 'bright', 'net')

In [241]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [242]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [243]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [244]:
data = pd.Series(data)

In [245]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [246]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [247]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [248]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [249]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [262]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [263]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [269]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [264]:
matches.str[:3]

AttributeError: Can only use .str accessor with string values!

In [266]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object